export default function kakSledovatKursuTopic() {
    return (
        <div className="space-y-4 text-zinc-300 leading-7">
            <h2 className="text-xl font-semibold text-white">Гайд по прохождению</h2>
            <p>Если ты здесь — значит, хочешь войти в мир IT и научиться создавать сайты с нуля.  Не волнуйся, если ты пока не знаешь, что такое HTML, CSS или Git — именно для этого и создан этот курс.</p>
            <p>Наш курс построен как дорожная карта.  Ты будешь двигаться от самых простых тем к более сложным, а вместе с текстовыми объяснениями тебя ждут видеоуроки и практические задания, которые помогут лучше понять материал.</p>
            <p>Готов прокачать свои навыки и построить карьеру в digital-мире? Тогда начнём 🚀</p>
            <h2 className="text-xl font-semibold text-white">💡 Как работать с курсом:</h2>
            <ol className="list-disc pl-6">
                <li>Начни с раздела «Введение», чтобы понять, как всё устроено.</li>
                <li>Проходи уроки по порядку — темы связаны между собой.</li>
                <li>После каждого блока обязательно пробуй всё на практике. Ошибки — часть пути разработчика.</li>
                <li>Если чувствуешь, что что-то сложно — возвращайся, пересматривай видео и читай объяснения повторно. Также всегда можешь обратиться к ментору прикрепленному к вашей школе.</li>
            </ol>
            <p>🎯 Наша цель — не просто научить тебя писать код,  а помочь тебе понять логику веб-мира, чтобы ты смог уверенно двигаться дальше,  сам изучать новые инструменты и строить свои проекты.</p>
        </div>
    );
}