export default function chtoTakoeHTMLTopic() {
    return (
        <div className="space-y-4 text-zinc-300 leading-7">
            <iframe width="800" height="440" src="https://www.youtube.com/embed/ScMzIvxBSi4"
                    title="YouTube video player" frameBorder="0" className="rounded-2xl"
                    allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture"
                    allowFullScreen />
            <p>HTML (HyperText Markup Language) — это язык, с которого начинается любой сайт.  Он не является языком программирования — HTML нужен, чтобы структурировать содержимое на веб-странице: текст, изображения, видео, кнопки и многое другое.</p>
            <p>💡 Проще говоря:<br/> HTML — это как «скелет» сайта.<br/> Он показывает, что находится на странице и в каком порядке, а вот как всё выглядит (цвета, шрифты, размеры) — задаётся уже с помощью CSS.</p>
            <h2 className="text-xl font-semibold text-white">Пример:</h2>
            <div className="bg-[#141414] text-gray-100 rounded-xl p-4 font-mono text-sm overflow-x-auto">
                <pre><code>
                    <p className="text-lg mb-2">html</p>
                    &lt;h1&gt;Привет, мир!&lt;/h1&gt; <br/>
                    &lt;p&gt;Это мой первый сайт&lt;/p&gt;
                </code></pre>
            </div>
            <p>🖥️ На странице это будет выглядеть так: <br/>
                Привет, CSC!<br/> Это мой первый сайт на HTML.</p>
            <h2 className="text-xl font-semibold text-white">🧠 Зачем учить HTML</h2>
            <ul className="list-disc pl-6">
                <li>Без него невозможно создать сайт. Даже самые современные фреймворки и конструкторы используют HTML внутри.</li>
                <li>Он помогает понимать, как работает интернет.</li>
                <li>Это простой старт для входа в веб-разработку. С него начинают все — от новичков до профессионалов.</li>
                <li>Знание HTML полезно дизайнерам и создателям контента, чтобы понимать, как их идеи воплощаются в коде.</li>
            </ul>
        </div>
    );
}